wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Source/gd32h77x_exmc.c
#ifdef FW_DEBUG_ERR_REPORT
    /* check for null pointer */
    if((NULL == exmc_nand_init_struct) || (NULL == exmc_nand_init_struct->attribute_space_timing) ||
            (NULL == exmc_nand_init_struct->common_space_timing)) {
        fw_debug_report_err(EXMC_MODULE_ID, API_ID(0x0008U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* configure nctl for EXMC_NCTL */
        nctl = (uint32_t)((exmc_nand_init_struct->nand_nwait_gpio |
                           exmc_nand_init_struct->wait_feature << NCTL_NDWTEN_OFFSET) |
                          exmc_nand_init_struct->databus_width |
                          (exmc_nand_init_struct->ecc_logic << NCTL_ECCEN_OFFSET) |
                          exmc_nand_init_struct->ecc_size |
                          exmc_nand_init_struct->ctr_latency |
                          exmc_nand_init_struct->atr_latency);

        /* configure nctcfg for EXMC_NCTCFG */
        nctcfg = (uint32_t)(((exmc_nand_init_struct->common_space_timing->setuptime - 1U) & EXMC_NCTCFG_COMSET) |
                            (((exmc_nand_init_struct->common_space_timing->waittime - 1U) << NCTCFG_COMWAIT_OFFSET) & EXMC_NCTCFG_COMWAIT) |
                            ((exmc_nand_init_struct->common_space_timing->holdtime << NCTCFG_COMHLD_OFFSET) & EXMC_NCTCFG_COMHLD) |
                            (((exmc_nand_init_struct->common_space_timing->databus_hiztime - 1U) << NCTCFG_COMHIZ_OFFSET) & EXMC_NCTCFG_COMHIZ));

        /* configure natcfg for EXMC_NATCFG */
        natcfg = (uint32_t)(((exmc_nand_init_struct->attribute_space_timing->setuptime - 1U) & EXMC_NATCFG_ATTSET) |
                            (((exmc_nand_init_struct->attribute_space_timing->waittime - 1U) << NATCFG_ATTWAIT_OFFSET) & EXMC_NATCFG_ATTWAIT) |
                            ((exmc_nand_init_struct->attribute_space_timing->holdtime << NATCFG_ATTHLD_OFFSET) & EXMC_NATCFG_ATTHLD) |
                            ((exmc_nand_init_struct->attribute_space_timing->databus_hiztime << NATCFG_ATTHIZ_OFFSET) & EXMC_NATCFG_ATTHIZ));

        /* initialize EXMC_BANK2_NAND */
        EXMC_NCTL = nctl;
        EXMC_NCTCFG = nctcfg;
        EXMC_NATCFG = natcfg;
    }
}

/*!
    \brief      enable NAND bank (API_ID(0x0009U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void exmc_nand_enable(void)
{
    EXMC_NCTL |= EXMC_NCTL_NDBKEN;
}

/*!
    \brief      disable NAND bank (API_ID(0x000AU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void exmc_nand_disable(void)
{
    EXMC_NCTL &= ~EXMC_NCTL_NDBKEN;
}

/*!
    \brief      deinitialize EXMC SDRAM device (API_ID(0x000BU))
   \param[in]   exmc_sdram_device: select the SRAM device
                only one parameter can be selected which is shown as below:
      \arg        EXMC_SDRAM_DEVICEx(x=0, 1)
    \param[in]  none
    \param[out] none
    \retval     none
*/
void exmc_sdram_deinit(uint32_t exmc_sdram_device)
{
    /* reset SDRAM registers */
    EXMC_SDCTL(exmc_sdram_device) = SDRAM_DEVICE_SDCTL_RESET;
    EXMC_SDTCFG(exmc_sdram_device) = SDRAM_DEVICE_SDTCFG_RESET;
    EXMC_SDCMD = SDRAM_DEVICE_SDCMD_RESET;
    EXMC_SDARI = SDRAM_DEVICE_SDARI_RESET;
    EXMC_SDRSCTL = SDRAM_DEVICE_SDRSCTL_RESET;
}

/*!
    \brief      initialize exmc_sdram_parameter_struct with the default values (API_ID(0x000CU))
    \param[in]  none
    \param[out] the initialized struct exmc_parameter_struct pointer
    \retval     none
*/
void exmc_sdram_struct_para_init(exmc_sdram_parameter_struct *exmc_sdram_init_struct)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check for null pointer */
    if(NULL == exmc_sdram_init_struct) {
        fw_debug_report_err(EXMC_MODULE_ID, API_ID(0x000CU), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* configure the structure with default values */
        exmc_sdram_init_struct->sdram_device = EXMC_SDRAM_DEVICE0;
        exmc_sdram_init_struct->column_address_width = EXMC_SDRAM_COW_ADDRESS_8;
        exmc_sdram_init_struct->row_address_width = EXMC_SDRAM_ROW_ADDRESS_11;
        exmc_sdram_init_struct->data_width = EXMC_SDRAM_DATABUS_WIDTH_16B;
        exmc_sdram_init_struct->internal_bank_number = EXMC_SDRAM_4_INTER_BANK;
        exmc_sdram_init_struct->cas_latency = EXMC_CAS_LATENCY_1_SDCLK;
        exmc_sdram_init_struct->write_protection = ENABLE;
        exmc_sdram_init_struct->sdclock_config = EXMC_SDCLK_DISABLE;
        exmc_sdram_init_struct->burst_read_switch = DISABLE;
        exmc_sdram_init_struct->pipeline_read_delay = EXMC_PIPELINE_DELAY_0_CK_EXMC;

        exmc_sdram_init_struct->timing = NULL;
    }
}

/*!
    \brief      initialize EXMC SDRAM device (API_ID(0x000DU))
    \param[in]  exmc_sdram_init_struct: configure the EXMC SDRAM parameter
                  sdram_device: EXMC_SDRAM_DEVICE0,EXMC_SDRAM_DEVICE1
                  pipeline_read_delay: EXMC_PIPELINE_DELAY_x_CK_EXMC,x=0~2
                  burst_read_switch: ENABLE or DISABLE
                  sdclock_config: EXMC_SDCLK_DISABLE,EXMC_SDCLK_PERIODS_2_CK_EXMC,EXMC_SDCLK_PERIODS_3_CK_EXMC,EXMC_SDCLK_PERIODS_4_CK_EXMC,EXMC_SDCLK_PERIODS_5_CK_EXMC
                  write_protection: ENABLE or DISABLE
                  cas_latency: EXMC_CAS_LATENCY_x_SDCLK,x=1~3
                  internal_bank_number: EXMC_SDRAM_2_INTER_BANK,EXMC_SDRAM_4_INTER_BANK
                  data_width: EXMC_SDRAM_DATABUS_WIDTH_8B,EXMC_SDRAM_DATABUS_WIDTH_16B,EXMC_SDRAM_DATABUS_WIDTH_32B
                  row_address_width: EXMC_SDRAM_ROW_ADDRESS_x,x=11~13
                  column_address_width: EXMC_SDRAM_COW_ADDRESS_x,x=8~11
                  timing: exmc_sdram_timing_parameter_struct set the time
                    row_to_column_delay: 1~16
                    row_precharge_delay: 1~16
                    write_recovery_delay: 1~16
                    auto_refresh_delay: 1~16
                    row_address_select_delay: 1~16
                    exit_selfrefresh_delay: 1~16
                    load_mode_register_delay: 1~16
    \param[out] none
    \retval     none
*/
void exmc_sdram_init(exmc_sdram_parameter_struct *exmc_sdram_init_struct)
{
    uint32_t sdctl0, sdctl1, sdtcfg0, sdtcfg1;

